---
type: FilterIntegerRule
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# FilterIntegerRule

`Autodesk.Revit.DB.FilterIntegerRule` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterIntegerRule | 2011 | `public FilterIntegerRule ( FilterableValueProvider valueProvider , FilterNumericRuleEvaluator evaluator , int ruleValue )` |
| Property | RuleValue | 2011 | `public int RuleValue { get ; set ; }` |